{
    "content": "My WhatsApp Web è un wrapper per WhatsApp web scritto in vala con supporto per più sessioni (account diversi).\n\n&Egrave; possibile avviarlo con i seguenti parametri:\n\n - --session=nome_della_sessione: avvia la sessione specificata (se non specificato come parametro verrà usata la sessione con nome \"default\")\n - --incognito: avvia una sessione in incognito, o meglio in private mode, ovvero non salva nulla sul disco\n - --level=livello_logging: imposta il livello di logging (se non specificato usa come valore error)\n\nPossibili livelli di logging:\n\n - none: nulla, non logga nulla\n - error: logga solamente gli errori\n - info: logga i messaggi di errore e informativi\n - debug: logga tutto in modalità verbosa\n\n---\n\n###Installazione \n\nPrima di tutto lanciare il comando build.sh contenuto in src per compilare il programma, le uniche dipendenze necessare (oltre a vala chiaramente) sono libnotify, gtk+ (v. 3.0) e webkit2gtk (v. 4.0).\n\nPer installarlo è sufficiente lanciare lo script install.sh presente nel repositoy git.\n\n&Egrave; anche possibile installarlo manualmente seguendo i passi:\n\n 1. Copiare il file mywhatsappweb.png in $HOME/.local/share/icons/ (oppure in $HOME/.icons a seconda di come avete configurato la vostra home) o /usr/share/icons/ se volete rendere il programma disponibile a tutti gli utenti.\n 2. Copiare il file creato durante la build in $HOME/.local/bin/ (o altra cartella presente nel vostro $PATH) oppure in /usr/local/bin/ se volete rendere il programma disponibile a tutti gli utenti.\n 3. Verificare che il file copiato sia eseguibile (prer renderlo eseguibile potete usare il comando `chmod +x percorso_completo_al_file_con_nome_del_file`)\n 4. Modificate il file mywhatsappweb.desktop cambiando il valore di @image\\_path@ con il percorso dove avete copiato l'icona e il valore di @bin\\_path@ con il percorso dove avete copiato l'eseguibile.\n 5. Copiate il file .desktop appena modifica in $HOME/.local/share/applications/ oppure /usr/share/applications/ nel caso vogliate rendere il programma disponibile a tutti gli utenti.\n\n###Download:\n\n[Repository](${github_url}/mywhatsappweb/)\n\n[20230504.1000](${github_url}/mywhatsappweb/release/tag/20230504.1000)\n\n###Rilasci:\n\n[20230504.1000](${site_url}/articles/2023/05/04/mywhatsappweb) - 04/05/2023",
    "template": "page",
    "title": "MyWhatsAppWeb",
    "type": "markdown"
}