{
    "content": "Site2App è un semplice programma vala che tramite webkit consente di wrappare siti web affinché assomiglino a un'app locale.\n\nAccetta i seguenti parametri di avvio:\n\n - --session=session\\_name opzionale, imposta il nome della sessione, se non specificato verrà usato default (attenzione, applicazioni con la stessa sessione condividono gli stessi dati)\n - --app=application\\_name obbligatorio, setta il nome dell'applicazione sia nella finestra che per le notifiche\n - --appurl=application\\_url obbligatorio, l'url del sito da mostrare\n - --tray opzionale, indica se è necessario mostrare un'icona nella tray (default false)\n - --icon=icon\\_path opzionale, usa l'icona specificata (path completo), se non specificata il programma disegnerà un'icona custom\n - --level=none|error|info|debug opzionale, setta il livello di logging (di default settato a error)\n - --private opzionale, crea un'istanza privata (i dati non vengono salvati sul disco, di default è false)\n - --save opzionale, crea un file .desktop per visualizzare il sito nel menu delle applicazioni (di default è false, anche se passato come parametro viene ignorato nel caso si utilizzi con --private)\n - --help mostra un messaggio di aiuto e esce.\n\nLo script test.sh contiene alcuni esempi di utilizzo.\n\n---\n\n###Installazione\n\nPrima di tutto lanciare il comando build.sh contenuto in src per compilare il programma, le uniche dipendenze necessare (oltre a vala chiaramente) sono libnotify, gtk+ (v. 3.0) e webkit2gtk (v. 4.0).\n\nPer installarlo è sufficiente lanciare lo script install.sh presente nel repositoy git.\n\n&Egrave; anche possibile installarlo manualmente seguendo i passi:\n\n 1. Copiare il file creato durante la build in $\\{HOME\\}/.local/bin/ (o altra cartella presente nel vostro $PATH) oppure in /usr/local/bin/ se volete rendere il programma disponibile a tutti gli utenti.\n 2. Verificare che il file copiato sia eseguibile (prer renderlo eseguibile potete usare il comando chmod +x )\n\n###Download:\n\n[Respository](${github_url}/Site2App)\n\n[20230503.1800](${github_url}/Site2App/releases/tag/20230503.1800)\n\n###Rilasci:\n\n[20230503.1800](${site_url}/articles/2023/05/03/site2app)",
    "template": "page",
    "title": "Site2App",
    "type": "markdown"
}